import random

suffix = ['ов', 'ев', 'ёв', 'ин', 'их', 'ский', 'цкий', 'ый', 'ой', 'ий']
base = ['Иван', 'Алексе', 'Кузнец', "Богомол", "Бочар", "Коваль", "Токар", "Федьк", "Гераськ", "Маш", "Кат", "Вал",
        "Мелк", "Бел", "Мел", "Успен", "Вознесен", "Трои", "Соловь", "Толст", "Лоз"]
names = ["Александр", "Михаил", "Иван", "Максим", "Артём", "Даниил", "Дмитрий", "Кирилл", "Андрей", "Егор", "Илья",
         "Алексей", "Владимир", "Матвей",
         "Тимофей", "Ярослав", "Роман", "Фёдор", "Никита", "Марк", "Сергей", "Николай", "Владислав", "Степан", "Глеб",
         "Лев", "Павел", "Евгений", "Арсений",
         "Константин", "Георгий", "Григорий", "Тимур", "Макар", "Игорь", "Руслан", "Пётр", "Виктор", "Денис", "Семён",
         "Платон",
         "Артемий", "Богдан", "Василий", "Юрий", "Давид", "Данила", "Леонид", "Антон", "Вячеслав"]


def roll():
    suf = suffix[random.randint(0, len(suffix) - 1)]
    bs = base[random.randint(0, len(base) - 1)]
    if (suf[0] == bs[-1] and suf[-1] != 'е') or (bs[-1] == 'е' and suf[0] == 'о'):
        return roll()
    else:
        return bs + suf

for i in range(10):
    print(f'{names[random.randint(0, len(names) - 1)]} {names[random.randint(0, len(names) - 1)][0]}. {roll()}')